/**
\file CheckString.h
\brief Модуль содержит функцию проверки является ли строка кратной заданному числу K.

Принцип работы функции
- взять первые K символов и использовать их как шаблон
- двигаясь по строке сравнивать очередные K символов с шаблоном
- сравнение происходит от начала к концу и от конца к началу (нужно чтобы
быстрее найти несоответствие если оно ближе к концу строки).

Если ЭВМ, на которой запущена программа, имеет более одного расчётного ядра
- используется многопоточная версия функции для одновременной проверки с двух
концов строки
*/

#pragma once

#include <string>

namespace check_string {
	/**
	Проверить является ли строка кратной числу K
	\param[in] stringToCheck Строка, чью кратность проверить
	\param[in] K Количество символов от начала строки которые должны повторяться
	\return Признак кратности строки заданному числу
	*/
	bool isPeriodic(const std::string& stringToCheck, size_t K);

	/**
	Протестировать функцию isPeriodic()
	*/
	void testIsPeriodic();
}
